{
  "apply_layernorm": true,
  "architectures": [
    "Dinov2ForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "drop_path_rate": 0.0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "antelope",
    "1": "bear",
    "2": "boar",
    "3": "cat",
    "4": "chimpanzee",
    "5": "cow",
    "6": "deer",
    "7": "dog",
    "8": "fox",
    "9": "goat",
    "10": "hare",
    "11": "leopard",
    "12": "owl",
    "13": "ox",
    "14": "pig",
    "15": "reindeer",
    "16": "sheep",
    "17": "snake",
    "18": "wild boar",
    "19": "wolf"
  },
  "image_size": 518,
  "initializer_range": 0.02,
  "label2id": {
    "antelope": 0,
    "bear": 1,
    "boar": 2,
    "cat": 3,
    "chimpanzee": 4,
    "cow": 5,
    "deer": 6,
    "dog": 7,
    "fox": 8,
    "goat": 9,
    "hare": 10,
    "leopard": 11,
    "owl": 12,
    "ox": 13,
    "pig": 14,
    "reindeer": 15,
    "sheep": 16,
    "snake": 17,
    "wild boar": 18,
    "wolf": 19
  },
  "layer_norm_eps": 1e-06,
  "layerscale_value": 1.0,
  "mlp_ratio": 4,
  "model_type": "dinov2",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "out_features": [
    "stage12"
  ],
  "out_indices": [
    12
  ],
  "patch_size": 14,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "reshape_hidden_states": true,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4",
    "stage5",
    "stage6",
    "stage7",
    "stage8",
    "stage9",
    "stage10",
    "stage11",
    "stage12"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "use_mask_token": true,
  "use_swiglu_ffn": false
}
